{"pages":[{"title":"Polskie znaki w LaTeX-u (Ubuntu, Times New Roman)","url":"/pl/articles/latex-custom-fonts/","text":"LaTeX jest darmowym systemem składania tekstu (ang. typesetting). Jest ceniony za wiele właściwości takich jak automatyzacja procesu (generowanie bibliografii, odsyłaczy, równań matematycznych). Pozwala na skupienie się na tekście zamiast na jego wyglądzie poprzez wykorzystanie plików ze stylami (np. bibliografii) odpowiednich dla danego czasopisma. Przede wszystkim jest dostępny również na różne dystrybucje Linuxa. Jednym z problemów, na jakie można napotkać podczas pisania pracy, są wymagania dotyczące użycia określonych czcionek. Standardowo wykorzystuje się następujące paczki zapewniające wsparcie dla polskich znaków: \\usepackage[utf8]{inputenc} \\usepackage[T1]{fontenc} \\usepackage{polski} Taka konfiguracja zazwyczaj wystarcza przy założeniu, że pliki kodowane są w systemie UTF-8. Następnie wybieramy czcionkę \\usepackage{times}. Niestety zarówno przestarzała paczka times, jak i nowsze mathptmx, pslatex, oraz txfonts (newtxtext/newtxmath) wykorzystują tak naprawdę czcionki URW NimbusRomNo9L, które są bardzo podobne do Times Roman. Ponadto mimo tego, że polskie znaki wyświetlane są poprawnie, to podczas kopiowania mogą wystąpić błędy. Warto zwrócić na to uwagę, gdyż w programach antyplagiatowych wyrazy z polskimi literami zostaną nierozpoznane. Zażółć gęślą jaźń Zażółć g ̨eśl a ̨ jaźń W celu rozwiązania tego tego problemu można skorzystać z innej czcionki - TeX Gyre Termes: \\usepackage{tgtermes}. Z innymi rodzajami czcionek zapoznać się można w bazie wiedzy ShareLaTeX. Oryginalna czcionka Times New RomanNajprostszy sposób na załadowanie znanych z Windowsa czcionek na Ubuntu składa się z 3 kroków: Instalacja czcionek TrueType Microsoft: sudo apt-get install ttf-mscorefonts-installer Podczas instalacji pojawi się okno z warunkami udzielenia licencji (Microsoft EULA). Czcionki zostały udostępnione za darmo jednak nie są one open-source. Zastąpienie paczek inputenc i fontenc następującymi komendami: \\usepackage{fontspec} \\setmainfont{Times New Roman} Zmiana programu pdflatex na xelatex: xelatex main.tex bibtex main xelatex main.tex xelatex main.tex W praktyce proces generowania pliku pdf może się nieco wydłużyć. W przypadku innego kodowania plików należy zastosować polecenia \\XeTeXinputencoding dla poprzedzającego tekstu bądź \\XeTeXdefaultencoding standardowo dla wszystkich plików, np. \\XeTeXdefaultencoding “cp1250” (kodowanie używane przez Microsoft Windows dla języków środkowoeuropejskich, w tym polskiego). Czcionki niestandardoweJeśli chcemy użyć czcionek niestandardowych np. Arial Narrow wystarczy przenieść je (rozszerzenie ttf dla czcionek TrueType) do stworzonego katalogu w /usr/share/fonts/.","tags":"latex linux ubuntu times-new-roman czcionki polskie-znaki","lang":"pl"},{"title":"Diacritics in LaTeX (Ubuntu, Times New Roman)","url":"/en/articles/latex-custom-fonts/","text":"LaTeX is a free typesetting system. It is valued for many properties such as automated processing (generating bibliographies, links, mathematical equations). It allows you to focus on the text instead of its appearance by using files with styles (e.g. bibliography) suitable for a given journal. Foremostly, it is also available for various Linux distributions. One of the problems you may encounter while writing an article are the requirements for the use of certain fonts. By default, the following packages are used to provide support for language characters (accents/diacritics): \\usepackage[utf8]{inputenc} \\usepackage[T1]{fontenc} \\usepackage[your_language]{babel} %e.g. \\usepackage[slovak]{babel} Such configuration usually suffices assuming that the files are encoded in the UTF-8 system. Next choose the font \\usepackage{times}. Unfortunately both outdated times and newer mathptmx, pslatex and txfonts (newtxtext/newtxmath) underneath use URW NimbusRomNo9L fonts that are very similar to Times Roman but they are not same. Although language specific characters are displayed correctly, errors may occur during copying. It is worth paying attention to it because in anti-plagiarism programs, words with these letters will be unrecognized. ÁÄĎÉÍĽĹŇÓÔŔŤÚÝáäďéíľĺňóôŕťúý ÁÄĎÉÍL’ĹŇÓÔŔŤÚÝáäd’éíl’ĺňóôŕt’úý To solve this problem, you can use a different font - TeX Gyre Termes: \\usepackage{tgtermes}. You can read more about other fonts in the ShareLaTeX knowledge base. Original Times New Roman fontThe easiest way to load fonts on Ubuntu known from Windows consists of three steps: Installation of TrueType Microsoft fonts: sudo apt-get install ttf-mscorefonts-installer During the installation process you will be asked to accept Microsoft EULA. The fonts have been made available for free but they are not open-source. Replacement inputenc and fontenc packages with the following commands: \\usepackage{fontspec} \\setmainfont{Times New Roman} Program change from pdflatex to xelatex: xelatex main.tex bibtex main xelatex main.tex xelatex main.tex W praktyce proces generowania pliku pdf może się nieco wydłużyć. W przypadku innego kodowania plików należy zastosować polecenia \\XeTeXinputencoding dla poprzedzającego tekstu bądź \\XeTeXdefaultencoding standardowo dla wszystkich plików, np. \\XeTeXdefaultencoding “cp1250” (kodowanie używane przez Microsoft Windows dla języków środkowoeuropejskich, w tym polskiego). In practice, the process of generating a pdf file may be slightly longer. For other file endocings use the \\XeTeXinputencoding command for the preceding text or \\XeTeXdefaultencoding as a standard for all files, e.g. \\XeTeXdefaultencoding “cp1250” (coding used by Microsoft Windows for Central European languages). Custom fontsIf you want to use custom fonts like Arial Narrow, just place them (ttf extension for TrueType fonts) in a directory created under /usr/share/fonts/.","tags":"latex fonts accents special-characters diacritics linux ubuntu times-new-roman","lang":"en"},{"title":"Splash! dokumentacja","url":"/pl/articles/splash/","text":"Splash! To wieloplatformowy, rastrowy edytor graficzny wzorowany na programach takich jak Photoshop, Gimp czy Microsoft Paint. Ideą przyświecającą aplikacji było wypełnienie luki pomiędzy prostym i intuicyjnym Paintem a zaawansowanym i topornym Gimpem. Aplikacja została napisana w języku Java przy użyciu biblioteki Swing. Głownym celem projektu była nauka i praktyczne wykorzystanie wielu wzorców projektowych. Poniżej znajduje się Przewodnik użytkownika oraz wybrane części dokumentacji. Głównym celem drugiego dokumentu jest opisanie użycia ponad 11 wzorców projektowych użytych w projekcie wraz z diagramami UML - jaki wzorzec, dlaczego i gdzie został użyty w projekcie. Zastosowanie niektórych z nich może wydawać się wymuszone. Niemniej jednak w momencie projektowania ich wybór przyczynił się do procesu myślowego prowadzącego do wyciągnięcie wniosków na zakończenie projektu. Splash! - Przewodnik użytkownikaSplash! - Wybrane części z dokumentacji (wzorce projektowe)","tags":"desktop uml grafika dokumentacja aplikacja przewodnik-użytkownika wzorce-projektowe","lang":"pl"},{"title":"Splash! documentation","url":"/en/articles/splash/","text":"Splash! is a multiplatform, raster graphics editor inspired by such programs as Photoshop, Gimp and Microsoft Paint. The idea while creating the application was to fill the gap between simple and intuitive Paint and advanced and crude Gimp. The application was written in Java using the Swing library. The main point though, was to learn and use in practice many different design patterns. Below you can check find an User’s guide and selected parts of documentation. The main point of the latter one is to describe the usage of over 11 design patterns used in the project with UML diagrams - what pattern, why and where has it been used in the project. Some of them might feel forced. Nevertheless, at the time of development their selection contributed to the thought process allowing to draw conclusions at the end of the project. Splash! - User’s guideSplash! - From docs (design patterns)","tags":"desktop graphics documentation application user-guide design-patterns uml","lang":"en"},{"title":"Witaj Świecie","url":"/pl/articles/hello-world/","text":"Witaj na mojej stronie! Strona została zaktualizowana do nowej wersji w formie niezobowiązującego bloga. Nowe artykuły nie będą pojawiać się zbyt często, a jedynie gdy będę chciał się podzielić czymś interesującym. W archiwum zamieszczone zostaną również galerie przedstawiające aplikacje, które stworzyłem.","tags":"ta-strona","lang":"pl"},{"title":"Hello World","url":"/en/articles/hello-world/","text":"Welcome! The site has been updated to a new version in the form of a non obliging blog. New articles will won’t appear too often, only when I’ll have something interesting to share. Furthermore, in the archives I will include some galleries from applications which I developed.","tags":"this-site","lang":"en"},{"title":"Wyszukiwanie","url":"/pl/search/index.html","text":"","tags":"","lang":"pl"},{"title":"Search","url":"/en/search/index.html","text":"","tags":"","lang":"en"},{"title":"Rozproszony Projekt Łowisk","url":"/pl/galleries/DistributedFisheryProject/index.html","text":"","tags":"","lang":"pl"},{"title":"Distributed Fishery Project","url":"/en/galleries/DistributedFisheryProject/index.html","text":"","tags":"","lang":"en"},{"title":"Support","url":"/support/index.html","text":"If you liked one of my projects and wish to support me: You can use PayPal Are you looking for help or you would like to report a bug in one of my applications? Create an issue in related repository on GitHub. Are you looking for someone to join your interesting open source project or someone to do a freelance job? Contact me.","tags":"","lang":"en"},{"title":"Support","url":"/en/support/index.html","text":"If you liked one of my projects and wish to support me: You can use PayPal Are you looking for help or you would like to report a bug in one of my applications? Create an issue in related repository on GitHub. Are you looking for someone to join your interesting open source project or someone to do a freelance job? Contact me.","tags":"","lang":"en"},{"title":"Wsparcie","url":"/pl/support/index.html","text":"Spodobały Ci się moje projekty i chciałbyś/chciałabyś mnie wesprzeć? Możesz skorzystać z Paypala Szukasz pomocy lub chciałbyś zgłosić błąd odnośnie jednej z moich aplikacji? Załóż issue w powiązanym repozytorium na GitHubie. Szukasz osoby do ciekawego projektu open source lub do wykonania zlecenia? Skontaktuj się ze mną.","tags":"","lang":"pl"},{"title":"About","url":"/en/about/index.html","text":"This site was generated thanks to Hexo framework with modified apollo theme and additional extensions: hexo-generator-i18n hexo-generator-feed hexo-generator-multilingual-archive hexo-generator-tipue-search-json hexo-generator-sitemap jQuery for tipue search and Fotorama Font Awesome Aldrich font and Press Start 2P font","tags":"","lang":"en"},{"title":"O stronie","url":"/pl/about/index.html","text":"Strona ta została wygenerowana przy pomocy platformy programistycznej Hexo wraz ze zmodyfikowanym szablonem apollo oraz dodatkowymi rozszerzeniami: hexo-generator-i18n hexo-generator-feed hexo-generator-multilingual-archive hexo-generator-sitemap hexo-generator-tipue-search-json jQuery do tipue search i Fotoramy Font Awesome czcionka Aldrich oraz czcionka Press Start 2P","tags":"","lang":"pl"}]}